test/fixtures/xml/ups/address_validation/street_request.xml

<envr:Envelope xmlns:auth='http://www.ups.com/schema/xpci/1.0/auth' xmlns:common='http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0' xmlns:envr='http://schemas.xmlsoap.org/soap/envelope/' xmlns:upss='http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0' xmlns:wsf='http://www.ups.com/schema/wsf' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'>
	<envr:Header>
		<upss:UPSSecurity>
			<upss:UsernameToken>
				<upss:Username>user name</upss:Username>
				<upss:Password>user pass</upss:Password>
			</upss:UsernameToken>
			<upss:ServiceAccessToken>
				<upss:AccessLicenseNumber>License number</upss:AccessLicenseNumber>
			</upss:ServiceAccessToken>
		</upss:UPSSecurity>
	</envr:Header>
	<envr:Body>
		<XAVRequest xmlns:common='http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0' xmlns='http://www.ups.com/XMLSchema/XOLTWS/xav/v1.0' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'>
			<Request xmlns='http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0'>
				<RequestOption>3</RequestOption>
			</Request>
			<AddressKeyFormat>
				<AddressLine>11811 North Freeway</AddressLine>
				<PoliticalDivision2>Houston</PoliticalDivision2>
				<PoliticalDivision1>TX</PoliticalDivision1>
				<PostcodePrimaryLow>77060</PostcodePrimaryLow>
				<CountryCode>US</CountryCode>
			</AddressKeyFormat>
		</XAVRequest>
	</envr:Body>
</envr:Envelope>