batchship2/scripts/PHPUPSWSDL/.svn/text-base/XOLTResult.xml.svn-base

Request: 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:ns2="http://www.ups.com/XMLSchema/XOLTWS/xav/v1.0" xmlns:ns3="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0"><SOAP-ENV:Header><ns3:UPSSecurity><ns3:UsernameToken><ns3:Username>brettmosley</ns3:Username><ns3:Password>DricasM4x</ns3:Password></ns3:UsernameToken><ns3:ServiceAccessToken><ns3:AccessLicenseNumber>1CB7DF83DFECF1D5</ns3:AccessLicenseNumber></ns3:ServiceAccessToken></ns3:UPSSecurity></SOAP-ENV:Header><SOAP-ENV:Body><ns2:XAVRequest><ns1:Request><ns1:RequestOption>1</ns1:RequestOption></ns1:Request><ns2:RegionalRequestIndicator></ns2:RegionalRequestIndicator><ns2:AddressKeyFormat><ns2:ConsigneeName>RITZ CAMERA CENTERS-1979</ns2:ConsigneeName><ns2:AddressLine>26601 ALISO CREEK ROAD</ns2:AddressLine><ns2:AddressLine>STE D</ns2:AddressLine><ns2:AddressLine>ALISO VIEJO TOWN CENTER</ns2:AddressLine><ns2:PoliticalDivision2>ALISO VIEJOj</ns2:PoliticalDivision2><ns2:PoliticalDivision1>CA</ns2:PoliticalDivision1><ns2:PostcodePrimaryLow>92656</ns2:PostcodePrimaryLow><ns2:PostcodeExtendedLow>1521</ns2:PostcodeExtendedLow><ns2:Urbanization>porto arundal</ns2:Urbanization><ns2:CountryCode>US</ns2:CountryCode></ns2:AddressKeyFormat></ns2:XAVRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>

Response: 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><xav:XAVResponse xmlns:xav="http://www.ups.com/XMLSchema/XOLTWS/xav/v1.0"><common:Response xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0"><common:ResponseStatus><common:Code>1</common:Code><common:Description>Success</common:Description></common:ResponseStatus></common:Response><xav:AmbiguousAddressIndicator/><xav:Candidate><xav:AddressKeyFormat><xav:PoliticalDivision2>ALISO VIEJO</xav:PoliticalDivision2><xav:PoliticalDivision1>CA</xav:PoliticalDivision1><xav:PostcodePrimaryLow>92656</xav:PostcodePrimaryLow><xav:Region>ALISO VIEJO CA 92656</xav:Region><xav:CountryCode>US</xav:CountryCode></xav:AddressKeyFormat></xav:Candidate><xav:Candidate><xav:AddressKeyFormat><xav:PoliticalDivision2>LAGUNA BEACH</xav:PoliticalDivision2><xav:PoliticalDivision1>CA</xav:PoliticalDivision1><xav:PostcodePrimaryLow>92656</xav:PostcodePrimaryLow><xav:Region>LAGUNA BEACH CA 92656</xav:Region><xav:CountryCode>US</xav:CountryCode></xav:AddressKeyFormat></xav:Candidate><xav:Candidate><xav:AddressKeyFormat><xav:PoliticalDivision2>LAGUNA HILLS</xav:PoliticalDivision2><xav:PoliticalDivision1>CA</xav:PoliticalDivision1><xav:PostcodePrimaryLow>92656</xav:PostcodePrimaryLow><xav:Region>LAGUNA HILLS CA 92656</xav:Region><xav:CountryCode>US</xav:CountryCode></xav:AddressKeyFormat></xav:Candidate></xav:XAVResponse></soapenv:Body></soapenv:Envelope>
